Repository: NicolaLS/payment-app
Catalog: apps/flint/feature/onboarding/src/iosMain/resources/FlintOnboarding.xcstrings
Source language: en
Languages: de, es

# onboarding_add_wallet_intro
source: Have the recovery phrase for the wallet you want Flint to use ready.
de: Halte die Wiederherstellungsphrase der Wallet bereit, die Flint verwenden soll.
es: Ten lista la frase de recuperación de la billetera que quieres usar con Flint.

# onboarding_add_wallet_step1
source: Open the wallet or backup where your recovery phrase is stored.
de: Öffne die Wallet oder Sicherung, in der deine Wiederherstellungsphrase gespeichert ist.
es: Abre la billetera o copia de seguridad donde guardas tu frase de recuperación.

# onboarding_add_wallet_step2
source: Enter the complete 12, 15, 18, 21, or 24-word phrase in Flint.
de: Gib die vollständige Phrase mit 12, 15, 18, 21 oder 24 Wörtern in Flint ein.
es: Ingresa en Flint la frase completa de 12, 15, 18, 21 o 24 palabras.

# onboarding_add_wallet_step3
source: Flint opens that Spark wallet and protects the phrase with this device’s secure storage.
de: Flint öffnet diese Spark-Wallet und schützt die Phrase im sicheren Speicher dieses Geräts.
es: Flint abre esa billetera Spark y protege la frase con el almacenamiento seguro de este dispositivo.

# onboarding_add_wallet_title
source: Import your Spark wallet
de: Spark-Wallet importieren
es: Importa tu billetera Spark

# onboarding_agreement_body
source: Using Flint is at your own risk. This app can spend from the Spark wallet derived from your recovery phrase. You are fully responsible for the phrase, funds, and payments made. We strongly recommend using a wallet with a small spending balance.
de: Die Nutzung von Flint erfolgt auf eigenes Risiko. Diese App kann Guthaben aus der Spark-Wallet ausgeben, die aus deiner Wiederherstellungsphrase abgeleitet wird. Du bist vollständig für die Phrase, das Guthaben und alle Zahlungen verantwortlich. Wir empfehlen dringend eine Wallet mit einem kleinen Ausgabeguthaben.
es: Usas Flint bajo tu propio riesgo. Esta aplicación puede gastar desde la billetera Spark derivada de tu frase de recuperación. Eres totalmente responsable de la frase, los fondos y los pagos realizados. Recomendamos usar una billetera con un saldo pequeño para gastos.

# onboarding_autopay_body
source: Choose when Flint should ask for confirmation before paying.
de: Wähle, wann Flint vor einer Zahlung um Bestätigung bitten soll.
es: Elige cuándo Flint debe pedir confirmación antes de pagar.

# onboarding_features_page1_body
source: Flint scans in the background so checkout stays smooth. Aim at the code, wait a beat, and you’re ready.
de: Flint scannt im Hintergrund, damit das Bezahlen reibungslos bleibt. Richte es auf den Code, warte kurz und schon kann es losgehen.
es: Flint escanea en segundo plano para que el pago sea fluido. Apunta al código, espera un instante y listo.

# onboarding_features_page1_subtitle
source: It’s working—even when the camera stays out of sight.
de: Er funktioniert, auch wenn die Kamera im Hintergrund bleibt.
es: Funciona aunque la cámara permanezca fuera de vista.

# onboarding_features_page1_title
source: Quiet scanner, quick results
de: Leiser Scanner, schnelle Ergebnisse
es: Escáner discreto, resultados rápidos

# onboarding_features_page2_body
source: Set a limit you’re comfortable with. For anything above it, Flint asks before paying.
de: Lege ein Limit fest, mit dem du dich wohlfühlst. Bei höheren Beträgen fragt Flint vor der Zahlung nach.
es: Define un límite con el que te sientas cómodo. Para cualquier monto superior, Flint pedirá confirmación.

# onboarding_features_page2_subtitle
source: Pay small amounts instantly with no extra taps.
de: Bezahle kleine Beträge sofort und ohne zusätzliche Schritte.
es: Paga montos pequeños al instante y sin pasos adicionales.

# onboarding_features_page2_title
source: Auto Pay, your rules
de: Auto Pay nach deinen Regeln
es: Auto Pay, bajo tus reglas

# onboarding_features_page3_body
source: The recovery phrase stays protected on this device while Flint focuses on fast in-person payments.
de: Die Wiederherstellungsphrase bleibt auf diesem Gerät geschützt, während Flint sich auf schnelle Zahlungen vor Ort konzentriert.
es: La frase de recuperación permanece protegida en este dispositivo mientras Flint se concentra en pagos presenciales rápidos.

# onboarding_features_page3_subtitle
source: Flint opens the wallet derived from your phrase.
de: Flint öffnet die aus deiner Phrase abgeleitete Wallet.
es: Flint abre la billetera derivada de tu frase.

# onboarding_features_page3_title
source: Your seed, your Spark wallet
de: Deine Phrase, deine Spark-Wallet
es: Tu frase, tu billetera Spark

# onboarding_welcome_subtitle_line1
source: by Bitcoin Coast
de: von Bitcoin Coast
es: por Bitcoin Coast

# onboarding_welcome_subtitle_line2
source: The quickest way to make payments from your Spark wallet.
de: Der schnellste Weg, mit deiner Spark-Wallet zu bezahlen.
es: La forma más rápida de pagar con tu billetera Spark.

# onboarding_welcome_title
source: Welcome to Flint
de: Willkommen bei Flint
es: Te damos la bienvenida a Flint
